class Meditations{
  final List<String> _angerMeditation = [
    "지금부터 당신의 분노를 다루는 명상을 시작하겠습니다. 편안한 자세로 앉거나 눕고, 눈을 감아주세요. 깊고 천천히 호흡하세요.",
    "숨을 깊게 들이마시고, 천천히 내쉬면서 몸의 긴장을 풀어보세요. 한 번 더 깊게 들이마시고, 천천히 내쉬세요. 이제 당신의 마음이 편안해지고 있음을 느껴보세요.",
    "지금 당신의 마음에 있는 분노를 떠올려보세요. 그 분노가 어떤 느낌인지, 몸의 어디에서 느껴지는지 인식해보세요. 그 분노를 판단하거나 억제하려 하지 말고, 그저 관찰하세요.",
    "분노를 느낄 때, 그것이 어떤 생각에서 비롯되었는지 떠올려보세요. 그 생각을 명확히 인식하고, 그 생각이 마음속에서 어떻게 움직이는지 지켜보세요.",
    "이제, 그 분노를 부드럽게 받아들이고, 숨을 깊게 들이마시면서 그 분노를 내쉬어보세요. 숨을 내쉴 때, 그 분노가 조금씩 사라져가는 것을 느껴보세요. 이 과정을 몇 번 반복하세요.",
    "지금부터 몇 분 동안, 당신은 그저 호흡에 집중하며 이 상태를 유지할 것입니다. 분노가 다시 떠오를 때마다, 그것을 판단하지 말고 그저 인식하고 호흡에 집중하세요."
  ];
  final List<String> _sadMeditation = [
    "지금부터 당신의 슬픔을 다루는 명상을 시작하겠습니다. 편안한 자세로 앉거나 눕고, 눈을 감아주세요. 깊고 천천히 호흡하세요.",
    "숨을 깊게 들이마시고, 천천히 내쉬면서 몸의 긴장을 풀어보세요. 한 번 더 깊게 들이마시고, 천천히 내쉬세요. 이제 당신의 마음이 편안해지고 있음을 느껴보세요.",
    "지금 당신의 마음에 있는 슬픔을 떠올려보세요. 그 슬픔이 어떤 느낌인지, 몸의 어디에서 느껴지는지 인식해보세요. 그 슬픔을 판단하거나 억제하려 하지 말고, 그저 관찰하세요.",
    "슬픔을 느낄 때, 그것이 어떤 생각에서 비롯되었는지 떠올려보세요. 그 생각을 명확히 인식하고, 그 생각이 마음속에서 어떻게 움직이는지 지켜보세요.",
    "이제, 그 슬픔을 부드럽게 받아들이고, 숨을 깊게 들이마시면서 그 슬픔을 내쉬어보세요. 숨을 내쉴 때, 그 슬픔이 조금씩 사라져가는 것을 느껴보세요. 이 과정을 몇 번 반복하세요.",
    "지금부터 몇 분 동안, 당신은 그저 호흡에 집중하며 이 상태를 유지할 것입니다. 슬픔이 다시 떠오를 때마다, 그것을 판단하지 말고 그저 인식하고 호흡에 집중하세요.",
  ];
  final List<String> _happyMeditation = [
    "지금부터 당신의 행복을 증진시키는 명상을 시작하겠습니다. 편안한 자세로 앉거나 눕고, 눈을 감아주세요. 깊고 천천히 호흡하세요.",
    "숨을 깊게 들이마시고, 천천히 내쉬면서 몸의 긴장을 풀어보세요. 한 번 더 깊게 들이마시고, 천천히 내쉬세요. 이제 당신의 마음이 편안해지고 있음을 느껴보세요.",
    "지금 당신의 마음에 행복한 기억이나 순간을 떠올려보세요. 그 기억이 어떤 느낌인지, 몸의 어디에서 느껴지는지 인식해보세요. 그 행복을 충분히 느끼고, 그 감정을 마음속에 담아두세요.",
    "행복한 기억을 떠올리면서, 그 순간에 느꼈던 감사함과 기쁨을 다시 한 번 느껴보세요. 그 감정을 현재로 가져와서, 지금 이 순간에 집중하세요.",
    "이제, 숨을 깊게 들이마시면서 그 행복감을 가슴 속 깊이 채워보세요. 숨을 내쉴 때, 그 행복감이 온몸으로 퍼져나가는 것을 느껴보세요. 이 과정을 몇 번 반복하세요.",
    "지금부터 몇 분 동안, 당신은 그저 호흡에 집중하며 이 상태를 유지할 것입니다. 행복감이 더욱 깊어지도록, 숨을 들이마실 때마다 그 감정을 강화해보세요.",
  ];
  final List<String> _justMeditation = [
    "지금부터 편안한 명상을 시작하겠습니다. 편안한 자세로 앉거나 눕고, 눈을 감아주세요. 깊고 천천히 호흡하세요.",
    "숨을 깊게 들이마시고, 천천히 내쉬면서 몸의 긴장을 풀어보세요. 한 번 더 깊게 들이마시고, 천천히 내쉬세요. 이제 당신의 마음이 편안해지고 있음을 느껴보세요.",
    "자신의 호흡에 집중해보세요. 숨이 들어오고 나가는 것을 느껴보세요. 들숨과 날숨에 온전히 집중하며, 지금 이 순간에 머물러보세요.",
    "생각이 떠오르면, 그것을 판단하지 말고 그저 흘려보내세요. 다시 호흡에 집중하세요. 숨이 들어오고 나가는 것을 느끼면서 마음을 편안하게 유지하세요.",
    "이제, 몸의 각 부분에 집중해보겠습니다. 발끝에서부터 시작하여 천천히 올라오면서 몸의 각 부분에 집중하고, 긴장을 풀어주세요. 발, 다리, 허리, 가슴, 어깨, 팔, 손, 목, 얼굴 순서로 집중하세요.",
    "각 부분에 집중하며 숨을 깊게 들이마시고, 내쉬면서 긴장을 풀어주세요. 몸 전체가 편안해지는 것을 느껴보세요.",
    "이제 몇 분 동안, 그저 호흡에 집중하며 이 상태를 유지할 것입니다. 마음이 편안해지고, 몸의 긴장이 풀리는 것을 느껴보세요.",
  ];


  List<String> getMeditation(String num){
    if(num == "1") return _angerMeditation;
    if(num == "2") return _sadMeditation;
    if(num == "3") return _happyMeditation;
    return _justMeditation;
  }

}